### Terraform Plan Output:

```
aws_iam_role.glue_role: Refreshing state... [id=glue-role-prod]
aws_s3_object.data_consumption_social_media_meta_script: Refreshing state... [id=scripts/glue/data-consumption-meta-month.py]
aws_key_pair.airflow_key_w: Refreshing state... [id=airflow-key-no-pass]
aws_iam_policy.glue_s3_prefix_policy: Refreshing state... [id=arn:aws:iam::654654560187:policy/glue-s3-prefix-policy]
data.aws_caller_identity.current: Reading...
aws_s3_object.marketing_data_simulation: Refreshing state... [id=scripts/python_shell/sample-meta-gen.py]
aws_iam_role.airflow_role: Refreshing state... [id=airflow-ec2-role]
aws_s3_object.data_transformation_social_media_script: Refreshing state... [id=scripts/glue/data-transformation-social-media.py]
aws_security_group.airflow_sg: Refreshing state... [id=sg-03bba002101cc61ab]
data.aws_caller_identity.current: Read complete after 0s [id=654654560187]
aws_iam_policy.airflow_dag_extended_permissions: Refreshing state... [id=arn:aws:iam::654654560187:policy/AirflowDagCommonActions]
aws_iam_role_policy_attachment.glue_custom_s3_access: Refreshing state... [id=glue-role-prod-20250510062649851000000001]
aws_iam_role_policy_attachment.glue_service_role: Refreshing state... [id=glue-role-prod-20250510062649993400000004]
aws_iam_role_policy_attachment.glue_console_access: Refreshing state... [id=glue-role-prod-20250510062649864900000002]
aws_iam_role_policy_attachment.athena_full_access: Refreshing state... [id=glue-role-prod-20250510062649979700000003]
aws_glue_job.data_transformation_social_media: Refreshing state... [id=data-transformation-social-media]
aws_glue_job.simulate_marketing_data: Refreshing state... [id=sdata-ingestion-social-media]
aws_glue_job.data_consumption_social_media_meta: Refreshing state... [id=data-consumption-social-media-meta]
aws_iam_role_policy_attachment.airflow_extended: Refreshing state... [id=airflow-ec2-role-20250510210855281700000001]
aws_iam_instance_profile.airflow_instance_profile: Refreshing state... [id=airflow-ec2-profile]
aws_iam_role_policy.ssm_read_airflow_admin: Refreshing state... [id=airflow-ec2-role:AirflowSSMReadAccess]
aws_instance.airflow: Refreshing state... [id=i-08293c6da9454b5b5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_key_pair.airflow_key_w must be replaced
-/+ resource "aws_key_pair" "airflow_key_w" {
      ~ arn             = "arn:aws:ec2:us-east-1:654654560187:key-pair/airflow-key-no-pass" -> (known after apply)
      ~ fingerprint     = "b1:02:8a:4e:99:d1:be:5d:46:86:ce:f0:69:a2:45:86" -> (known after apply)
      ~ id              = "airflow-key-no-pass" -> (known after apply)
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-0943dd77ca5e9a4c5" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      ~ public_key      = <<-EOT # forces replacement
          - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC5lJlRUMtDs8/Hzj6tXV/JU0wmKA8ITbvbpA0qrNx6JHRysZRt+UckfNifP2yA4BEIawpSqIRaARQrpEGTQmJ7eZ0J/w8zuwaXEOnRHZY3Tr9qegEgT6JM7ma9mFfGJi8HP0fWVWWcWrYFAV7xIqmP/AfqI4Gz70/HOPHZomdk9VQ6y8gOwiW5dRbI8YhZJOVZ9Mz1uuLeAkUtcMlYpV89/PNjh+nP5zcXfrrqwpPiCo+iwq0wgvs1kUwX/LQXKCdd9O+noqnqBJE2Rq2wlvGiUkjyCGS9GQCHJFtEYWoJgnVmuOUhukfC5pxSOSEbO43QDHot6WcA7cTRmxRhplfrqjjzszWraWvR5j+rVuINCPf3/SNS/QXZ4H7npnvUf7G1SMnSu0Hm9LF8xNiVv0yqVV1O2WSTNtQJEmKaMcxE/OLYlX7UmjNFDq5eJrAkD1kpOala1WkxFor6I9dHvTwE5t8JDJLs/jHgkfm9tv3NVeXcUj+MhxW3bkXocEhEFW2cwUn61LjK8pKJQ/Um36vL+r5FVyswEGcflkKOlFKjizxGukeoe02YRxUzpG6n/nJfjFvf9R21m9Qj+dq+WU/0yfNBVuHVFbICoa6DqMsX9981uzAD8lOJRcTHgV/zFU6Ld/xDD40urjGRr1R3+xh5SiH1JppfslZJsWRfudtGOw== mauriciobautistalopez@192.168.68.52
          + -----BEGIN OPENSSH PRIVATE KEY-----
          + b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAACFwAAAAdzc2gtcn
          + NhAAAAAwEAAQAAAgEAuZSZUVDLQ7PPx84+rV1fyVNMJigPCE2726QNKqzceiR0crGUbflH
          + JHzYnz9sgOARCGsKUqiEWgEUK6RBk0Jie3mdCf8PM7sGlxDp0R2WN06/anoBIE+iTO5mvZ
          + hXxiYvBz9H1lVlnFq2BQFe8SKpj/wH6iOBs+9Pxzjx2aJnZPVUOsvIDsIluXUWyPGIWSTl
          + WfTM9bri3gJFLXDJWKVfPfzzY4fpz+c3F3666sKT4gqPosKtMIL7NZFMF/y0FygnXfTvp6
          + Kp6gSRNkatsJbxolJI8ghkvRkAhyRbRGFqCYJ1ZrjlIbpHwuacUjkhGzuN0Ax6LelnAO3E
          + 0ZsUYaZX66o487M1q2lr0eY/q1biDQj39/0jUv0F2eB+56Z71H+xtUjJ0rtB5vSxfMTYlb
          + 9MqlVdTtlkkzbUCRJimjHMRPzi2JV+1JozRQ6uXiawJA9ZKTmpWtVpMRaK+iPXR708BObf
          + CQyS7P4x4JH5vbb9zVXl3FI/jIcVt25F6HBIRBVtnMFJ+tS4yvKSiUP1Jt+ry/q+RVcrMB
          + BnH5ZCjpRSo4s8RrpHqHtNmEcVM6Rup/5yX4xb3/UdtZvUI/navllP9MnzQVbh1RWyAqGu
          + g6jLF/ffNbswA/JTiUXEx4Ff8xVOi3f8Qw+NLq4xka9Ud/sYeUoh9SaaX7JWSbFkX7nbRj
          + sAAAdgWlaZa1pWmWsAAAAHc3NoLXJzYQAAAgEAuZSZUVDLQ7PPx84+rV1fyVNMJigPCE27
          + 26QNKqzceiR0crGUbflHJHzYnz9sgOARCGsKUqiEWgEUK6RBk0Jie3mdCf8PM7sGlxDp0R
          + 2WN06/anoBIE+iTO5mvZhXxiYvBz9H1lVlnFq2BQFe8SKpj/wH6iOBs+9Pxzjx2aJnZPVU
          + OsvIDsIluXUWyPGIWSTlWfTM9bri3gJFLXDJWKVfPfzzY4fpz+c3F3666sKT4gqPosKtMI
          + L7NZFMF/y0FygnXfTvp6Kp6gSRNkatsJbxolJI8ghkvRkAhyRbRGFqCYJ1ZrjlIbpHwuac
          + UjkhGzuN0Ax6LelnAO3E0ZsUYaZX66o487M1q2lr0eY/q1biDQj39/0jUv0F2eB+56Z71H
          + +xtUjJ0rtB5vSxfMTYlb9MqlVdTtlkkzbUCRJimjHMRPzi2JV+1JozRQ6uXiawJA9ZKTmp
          + WtVpMRaK+iPXR708BObfCQyS7P4x4JH5vbb9zVXl3FI/jIcVt25F6HBIRBVtnMFJ+tS4yv
          + KSiUP1Jt+ry/q+RVcrMBBnH5ZCjpRSo4s8RrpHqHtNmEcVM6Rup/5yX4xb3/UdtZvUI/na
          + vllP9MnzQVbh1RWyAqGug6jLF/ffNbswA/JTiUXEx4Ff8xVOi3f8Qw+NLq4xka9Ud/sYeU
          + oh9SaaX7JWSbFkX7nbRjsAAAADAQABAAACACfMpaDZye3oFyyLn8eAWfWMRq18M9UdDqfJ
          + JAW98r7DKLIcQW/gYRCDMdXdPUDaTOzYP+uANnoy9wdw/5s8RnCioToumC0I9B3bw7lUNg
          + 4Adm64YZtzWKRVEHWiwVg+giF0wcxGnjcNATJLm/fs7h5x96SQHtXfAeYA4WVCPhhZwMmn
          + QG1h18NRSCSqIAq2LfW/2WDtxo/EPt/C63t2Y9mgcPYshMlQlfEU/bMxLZPxneJTC992h7
          + dyRLZ0PI8mzmKJEAiMixIkDpxsRf20MXgVW42EnU4smX9iHaypk5scfl8cUg+Mqq0y1d2Q
          + YPg9Kmmu81j7UFrToz0snA9hJEOJTm6xP3FX/npx2CaySd9Fcyucl6I2PVVag0G15eAXxx
          + XTMSdEONPJRt1uLpmR5xOOb3yzPwihcD4/jDfeiRSV9UOqA8seOcncNrudrKcAazfub5PC
          + BwvG2ppERUQLkUD32XrTZ2CGjdKQTANmNfyoo7VWkuy9ja/n0gzLEnA8lDfZTAsKptpgqm
          + ANtCxUqN05WjLckiv5eLJmvCCNIsPPZIO3ANlXCY1B4jI7vNJTzEBxxsGQZGcjwgbhLrFG
          + xEBNnxb4QEO47TMFygBRWRedjS13tHMCqdMftz9/2Nir3Y1fljOLA8j/c9MEb4ELTdUsNP
          + 25qJrdgNHNzrLYnsIJAAABAQDOCh2qYP4ymn2JrMBG/EqzzTpFAFBkYPYRDUbr/igtjZiB
          + iCmUPCDUWHng7Ev9X7qBWNHvQtbD8+2hyFbcuFWqyPwHxUqK7Ds4RFVXe8dY2T/f+8HaEZ
          + tGo6dSfrV2v8IXBjkFT7F39106oxdtrwmMcOyDhvZ1UMabay5eRQE0gD5VZLEp41kfPZbN
          + SjXUIhf+agBnVn4K3MP7wKAskacOzsFc9r1lA5Lug1NLd4vLbZ7Y8crplUhOroKzvLFXsA
          + h8gUAsfe07EoGEPZgpEoJaqaPlSoZ8tRJEwlAv1EuOTB5xBVSOE189qHJn/v76wV5XClrL
          + qig3WG+doE8YOwCNAAABAQDxnX5K8kx67TDKEuWKLOrztamCofSyEDbhXvbqGqdmIkV/gR
          + jYmM/wybcy8VDrtb/B2Y2WeaUAVhBYcGK6jqrHFLDrhGA9IY4rQBq4x4xVxOy1ctHektDv
          + wj3yF/cDJEGJ5fFNGLSCnOo0z4EEkvwTOJBv9c3F1UTh1i1DsMKcDTKi0i08DdaXxNFEMv
          + L9/1A/GYOIDhjtyJMZvzAGjSe07eYWlCcrO0wF5q7zzAMqfT29v7AzgimdswJVPKqtGSC2
          + pl/eggwWyNnt8IM7tNUYZUqlbLKLNev6C/1oGP8KdLDx38Hxk/xmxSVi53phhEC0UOigUk
          + 1HFBTNOdjrLtyfAAABAQDEoRGQJlOhgbMU4N1Js3J+IMqYGVB9IS0LY9a0e3DviXg7irnS
          + 6/jecffJF3x61p7/EYgOOp6lEpGCsbHL608A0rJ4EC5+YnTKB4U6y3S3TFtgplR6a4jvUK
          + pKyDdgN/4Qxmie9iIB+lJvL75JXoHMg9dmNVuWmsgEtJHKFd62S3E2kTlSCQMLSPqkqlwV
          + Tq66iwQ9glCSKzgS+H/YME+OPrrFmw4zjNGzqus8pYVAZOPE5fdFfzbSAv5bwBxaPahPIG
          + 1r7fvKozexTRJqVENMYelkqw/ZFa1L0wg5un6Vo4jeBUdpIyS0guiyTmZ7BJNT0t8ffjaN
          + zGRPPO3gHJTlAAAAI21hdXJpY2lvYmF1dGlzdGFsb3BlekAxOTIuMTY4LjY4LjUyAQIDBA
          + UGBw==
          + -----END OPENSSH PRIVATE KEY-----
        EOT
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```